chapter4/naca/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
	INLET
	{
		type 		inletOutlet;
		inletValue	uniform (1 0 0);
		value 		uniform (0 0 0); 
	}
	SIDE
	{
		type 		inletOutlet;
		inletValue	uniform (1 0 0);
		value 		uniform (0 0 0); 
	}
	OUTLET
	{
		type	zeroGradient;
	}
	FOIL
	{
		type	fixedValue;
		value	uniform (0 0 0);
	}
	frontAndBack
	{
		type	empty;
	}
	SYM
	{
		type			symmetryPlane;
	}
}

// ************************************************************************* //
