chapter4/naca/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    INLET
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 0.05;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    SIDE
    {
        type            zeroGradient;
    }
    FOIL
    {
        type            kqRWallFunction;
        value           uniform 10;
    }
    frontAndBack
    {
        type            empty;
    }
    SYM
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
