chapter4/naca/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.14;

boundaryField
{
    INLET
    {
        type            freestream;
        freestreamValue uniform 0.14;
    }

    OUTLET
    {
        type            freestream;
        freestreamValue uniform 0.14;
    }
    SIDE
    {
        type            freestream;
        freestreamValue uniform 0.14;
	}

    FOIL
    {
        type            nutUWallFunction;
        value           uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
	SYM
	{
		type			symmetryPlane;
	}
}

// ************************************************************************* //
