chapter4/naca/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 77200;

boundaryField
{
    INLET
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    1.0;
        k               k;
        value           uniform 77200;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    SIDE
    {
        type            zeroGradient;
    }
    FOIL
    {
        type            omegaWallFunction;
        value           uniform 77200;
    }
    frontAndBack
    {
        type            empty;
    }
    SYM
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
