chapter4/naca/constant/polyMesh/blockMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii; 	
 class dictionary; 	
 object blockMeshDict; 	
}

convertToMeters 1.0;

vertices
  (
    (0 0 0)
    (0.049049 0 0.0352568)
    (0.049049 0.1 0.0352568)
    (0 0.1 0)

    (-2 0 0)
    (-0.300949 0 1.97723)
    (-0.300949 0.1 1.97723)
    (-2 0.1 0)

    (1 0 0)
    (1 0.1 0)
    (1.05 0 2)
    (1.05 0.1 2)

    (4 0 0)
    (4 0.1 0)
    (4 0 2)
    (4 0.1 2)
  ); 	

blocks
  (
    hex (0 1 2 3 4 5 6 7) (10 1 30) simpleGrading (1.000000 1.000000 50.000000)
    hex (1 8 9 2 5 10 11 6) (40 1 30) simpleGrading (1.000000 1.000000 50.000000)
    hex (8 12 13 9 10 14 15 11) (20 1 30) simpleGrading (18.851000 1.000000 50.000000)
  ); 	

patches
  (
    empty frontAndBack

    (

      (
        5
        4
        0
        1
      )

      (
        7
        6
        2
        3
      )

      (
        10
        5
        1
        8
      )

      (
        6
        11
        9
        2
      )

      (
        14
        10
        8
        12
      )

      (
        11
        15
        13
        9
      )
    )
    wall FOIL

    (

      (
        3
        2
        1
        0
      )

      (
        2
        9
        8
        1
      )
    )
    patch INLET

    (

      (
        4
        5
        6
        7
      )
    )
    patch OUTLET

    (

      (
        15
        14
        12
        13
      )
    )
    patch SIDE

    (

      (
        10
        14
        15
        11
      )

      (
        5
        10
        11
        6
      )
    )
    symmetryPlane SYM

    (

      (
        4
        7
        3
        0
      )

      (
        9
        13
        12
        8
      )
    )
  ); 	

edges
  (
    polyLine 0 1 (
(0.000000 0.000000 0.000000)
(0.001001 0.000000 0.005560)
(0.002002 0.000000 0.007818)
(0.003003 0.000000 0.009533)
(0.004004 0.000000 0.010966)
(0.005005 0.000000 0.012219)
(0.006006 0.000000 0.013344)
(0.007007 0.000000 0.014372)
(0.008008 0.000000 0.015322)
(0.009009 0.000000 0.016210)
(0.010010 0.000000 0.017045)
(0.011011 0.000000 0.017835)
(0.012012 0.000000 0.018586)
(0.013013 0.000000 0.019302)
(0.014014 0.000000 0.019988)
(0.015015 0.000000 0.020646)
(0.016016 0.000000 0.021280)
(0.017017 0.000000 0.021891)
(0.018018 0.000000 0.022482)
(0.019019 0.000000 0.023054)
(0.020020 0.000000 0.023609)
(0.021021 0.000000 0.024147)
(0.022022 0.000000 0.024670)
(0.023023 0.000000 0.025179)
(0.024024 0.000000 0.025676)
(0.025025 0.000000 0.026159)
(0.026026 0.000000 0.026631)
(0.027027 0.000000 0.027092)
(0.028028 0.000000 0.027543)
(0.029029 0.000000 0.027983)
(0.030030 0.000000 0.028414)
(0.031031 0.000000 0.028836)
(0.032032 0.000000 0.029250)
(0.033033 0.000000 0.029656)
(0.034034 0.000000 0.030053)
(0.035035 0.000000 0.030443)
(0.036036 0.000000 0.030826)
(0.037037 0.000000 0.031202)
(0.038038 0.000000 0.031572)
(0.039039 0.000000 0.031935)
(0.040040 0.000000 0.032291)
(0.041041 0.000000 0.032642)
(0.042042 0.000000 0.032987)
(0.043043 0.000000 0.033327)
(0.044044 0.000000 0.033661)
(0.045045 0.000000 0.033990)
(0.046046 0.000000 0.034314)
(0.047047 0.000000 0.034633)
(0.048048 0.000000 0.034947)
(0.049049 0.000000 0.035257)
)
    polyLine 3 2 (
(0.000000 0.100000 0.000000)
(0.001001 0.100000 0.005560)
(0.002002 0.100000 0.007818)
(0.003003 0.100000 0.009533)
(0.004004 0.100000 0.010966)
(0.005005 0.100000 0.012219)
(0.006006 0.100000 0.013344)
(0.007007 0.100000 0.014372)
(0.008008 0.100000 0.015322)
(0.009009 0.100000 0.016210)
(0.010010 0.100000 0.017045)
(0.011011 0.100000 0.017835)
(0.012012 0.100000 0.018586)
(0.013013 0.100000 0.019302)
(0.014014 0.100000 0.019988)
(0.015015 0.100000 0.020646)
(0.016016 0.100000 0.021280)
(0.017017 0.100000 0.021891)
(0.018018 0.100000 0.022482)
(0.019019 0.100000 0.023054)
(0.020020 0.100000 0.023609)
(0.021021 0.100000 0.024147)
(0.022022 0.100000 0.024670)
(0.023023 0.100000 0.025179)
(0.024024 0.100000 0.025676)
(0.025025 0.100000 0.026159)
(0.026026 0.100000 0.026631)
(0.027027 0.100000 0.027092)
(0.028028 0.100000 0.027543)
(0.029029 0.100000 0.027983)
(0.030030 0.100000 0.028414)
(0.031031 0.100000 0.028836)
(0.032032 0.100000 0.029250)
(0.033033 0.100000 0.029656)
(0.034034 0.100000 0.030053)
(0.035035 0.100000 0.030443)
(0.036036 0.100000 0.030826)
(0.037037 0.100000 0.031202)
(0.038038 0.100000 0.031572)
(0.039039 0.100000 0.031935)
(0.040040 0.100000 0.032291)
(0.041041 0.100000 0.032642)
(0.042042 0.100000 0.032987)
(0.043043 0.100000 0.033327)
(0.044044 0.100000 0.033661)
(0.045045 0.100000 0.033990)
(0.046046 0.100000 0.034314)
(0.047047 0.100000 0.034633)
(0.048048 0.100000 0.034947)
(0.049049 0.100000 0.035257)
)
    polyLine 7 6 (
(-2.000000 0.100000 0.000000)
(-1.999794 0.100000 0.028681)
(-1.999177 0.100000 0.057356)
(-1.998149 0.100000 0.086019)
(-1.996710 0.100000 0.114664)
(-1.994861 0.100000 0.143286)
(-1.992601 0.100000 0.171878)
(-1.989931 0.100000 0.200435)
(-1.986852 0.100000 0.228951)
(-1.983365 0.100000 0.257420)
(-1.979469 0.100000 0.285836)
(-1.975167 0.100000 0.314193)
(-1.970458 0.100000 0.342485)
(-1.965344 0.100000 0.370707)
(-1.959826 0.100000 0.398853)
(-1.953904 0.100000 0.426916)
(-1.947581 0.100000 0.454892)
(-1.940858 0.100000 0.482774)
(-1.933735 0.100000 0.510557)
(-1.926215 0.100000 0.538236)
(-1.918298 0.100000 0.565803)
(-1.909987 0.100000 0.593254)
(-1.901283 0.100000 0.620583)
(-1.892188 0.100000 0.647784)
(-1.882704 0.100000 0.674852)
(-1.872833 0.100000 0.701782)
(-1.862576 0.100000 0.728567)
(-1.851937 0.100000 0.755202)
(-1.840917 0.100000 0.781682)
(-1.829518 0.100000 0.808001)
(-1.817742 0.100000 0.834154)
(-1.805593 0.100000 0.860135)
(-1.793073 0.100000 0.885939)
(-1.780184 0.100000 0.911562)
(-1.766929 0.100000 0.936997)
(-1.753310 0.100000 0.962239)
(-1.739331 0.100000 0.987283)
(-1.724994 0.100000 1.012124)
(-1.710303 0.100000 1.036757)
(-1.695259 0.100000 1.061177)
(-1.679867 0.100000 1.085378)
(-1.664130 0.100000 1.109357)
(-1.648050 0.100000 1.133107)
(-1.631631 0.100000 1.156624)
(-1.614877 0.100000 1.179904)
(-1.597791 0.100000 1.202940)
(-1.580376 0.100000 1.225729)
(-1.562636 0.100000 1.248267)
(-1.544574 0.100000 1.270547)
(-1.526195 0.100000 1.292566)
(-1.507503 0.100000 1.314320)
(-1.488500 0.100000 1.335803)
(-1.469191 0.100000 1.357011)
(-1.449580 0.100000 1.377940)
(-1.429670 0.100000 1.398586)
(-1.409467 0.100000 1.418944)
(-1.388974 0.100000 1.439011)
(-1.368195 0.100000 1.458781)
(-1.347135 0.100000 1.478252)
(-1.325798 0.100000 1.497418)
(-1.304188 0.100000 1.516276)
(-1.282310 0.100000 1.534823)
(-1.260168 0.100000 1.553054)
(-1.237767 0.100000 1.570966)
(-1.215111 0.100000 1.588554)
(-1.192206 0.100000 1.605816)
(-1.169055 0.100000 1.622748)
(-1.145664 0.100000 1.639346)
(-1.122037 0.100000 1.655606)
(-1.098180 0.100000 1.671526)
(-1.074097 0.100000 1.687103)
(-1.049793 0.100000 1.702332)
(-1.025272 0.100000 1.717212)
(-1.000542 0.100000 1.731738)
(-0.975605 0.100000 1.745908)
(-0.950468 0.100000 1.759719)
(-0.925135 0.100000 1.773168)
(-0.899612 0.100000 1.786253)
(-0.873904 0.100000 1.798970)
(-0.848016 0.100000 1.811317)
(-0.821954 0.100000 1.823292)
(-0.795722 0.100000 1.834891)
(-0.769327 0.100000 1.846114)
(-0.742774 0.100000 1.856956)
(-0.716068 0.100000 1.867417)
(-0.689215 0.100000 1.877494)
(-0.662220 0.100000 1.887184)
(-0.635089 0.100000 1.896487)
(-0.607828 0.100000 1.905399)
(-0.580441 0.100000 1.913920)
(-0.552935 0.100000 1.922047)
(-0.525315 0.100000 1.929778)
(-0.497587 0.100000 1.937113)
(-0.469757 0.100000 1.944049)
(-0.441831 0.100000 1.950586)
(-0.413813 0.100000 1.956721)
(-0.385710 0.100000 1.962454)
(-0.357528 0.100000 1.967784)
(-0.329273 0.100000 1.972709)
(-0.300949 0.100000 1.977228)
)
    polyLine 4 5 (
(-2.000000 0.000000 0.000000)
(-1.999794 0.000000 0.028681)
(-1.999177 0.000000 0.057356)
(-1.998149 0.000000 0.086019)
(-1.996710 0.000000 0.114664)
(-1.994861 0.000000 0.143286)
(-1.992601 0.000000 0.171878)
(-1.989931 0.000000 0.200435)
(-1.986852 0.000000 0.228951)
(-1.983365 0.000000 0.257420)
(-1.979469 0.000000 0.285836)
(-1.975167 0.000000 0.314193)
(-1.970458 0.000000 0.342485)
(-1.965344 0.000000 0.370707)
(-1.959826 0.000000 0.398853)
(-1.953904 0.000000 0.426916)
(-1.947581 0.000000 0.454892)
(-1.940858 0.000000 0.482774)
(-1.933735 0.000000 0.510557)
(-1.926215 0.000000 0.538236)
(-1.918298 0.000000 0.565803)
(-1.909987 0.000000 0.593254)
(-1.901283 0.000000 0.620583)
(-1.892188 0.000000 0.647784)
(-1.882704 0.000000 0.674852)
(-1.872833 0.000000 0.701782)
(-1.862576 0.000000 0.728567)
(-1.851937 0.000000 0.755202)
(-1.840917 0.000000 0.781682)
(-1.829518 0.000000 0.808001)
(-1.817742 0.000000 0.834154)
(-1.805593 0.000000 0.860135)
(-1.793073 0.000000 0.885939)
(-1.780184 0.000000 0.911562)
(-1.766929 0.000000 0.936997)
(-1.753310 0.000000 0.962239)
(-1.739331 0.000000 0.987283)
(-1.724994 0.000000 1.012124)
(-1.710303 0.000000 1.036757)
(-1.695259 0.000000 1.061177)
(-1.679867 0.000000 1.085378)
(-1.664130 0.000000 1.109357)
(-1.648050 0.000000 1.133107)
(-1.631631 0.000000 1.156624)
(-1.614877 0.000000 1.179904)
(-1.597791 0.000000 1.202940)
(-1.580376 0.000000 1.225729)
(-1.562636 0.000000 1.248267)
(-1.544574 0.000000 1.270547)
(-1.526195 0.000000 1.292566)
(-1.507503 0.000000 1.314320)
(-1.488500 0.000000 1.335803)
(-1.469191 0.000000 1.357011)
(-1.449580 0.000000 1.377940)
(-1.429670 0.000000 1.398586)
(-1.409467 0.000000 1.418944)
(-1.388974 0.000000 1.439011)
(-1.368195 0.000000 1.458781)
(-1.347135 0.000000 1.478252)
(-1.325798 0.000000 1.497418)
(-1.304188 0.000000 1.516276)
(-1.282310 0.000000 1.534823)
(-1.260168 0.000000 1.553054)
(-1.237767 0.000000 1.570966)
(-1.215111 0.000000 1.588554)
(-1.192206 0.000000 1.605816)
(-1.169055 0.000000 1.622748)
(-1.145664 0.000000 1.639346)
(-1.122037 0.000000 1.655606)
(-1.098180 0.000000 1.671526)
(-1.074097 0.000000 1.687103)
(-1.049793 0.000000 1.702332)
(-1.025272 0.000000 1.717212)
(-1.000542 0.000000 1.731738)
(-0.975605 0.000000 1.745908)
(-0.950468 0.000000 1.759719)
(-0.925135 0.000000 1.773168)
(-0.899612 0.000000 1.786253)
(-0.873904 0.000000 1.798970)
(-0.848016 0.000000 1.811317)
(-0.821954 0.000000 1.823292)
(-0.795722 0.000000 1.834891)
(-0.769327 0.000000 1.846114)
(-0.742774 0.000000 1.856956)
(-0.716068 0.000000 1.867417)
(-0.689215 0.000000 1.877494)
(-0.662220 0.000000 1.887184)
(-0.635089 0.000000 1.896487)
(-0.607828 0.000000 1.905399)
(-0.580441 0.000000 1.913920)
(-0.552935 0.000000 1.922047)
(-0.525315 0.000000 1.929778)
(-0.497587 0.000000 1.937113)
(-0.469757 0.000000 1.944049)
(-0.441831 0.000000 1.950586)
(-0.413813 0.000000 1.956721)
(-0.385710 0.000000 1.962454)
(-0.357528 0.000000 1.967784)
(-0.329273 0.000000 1.972709)
(-0.300949 0.000000 1.977228)
)
    polyLine 1 8 (
(0.050050 0.000000 0.035562)
(0.051051 0.000000 0.035863)
(0.052052 0.000000 0.036159)
(0.053053 0.000000 0.036452)
(0.054054 0.000000 0.036740)
(0.055055 0.000000 0.037025)
(0.056056 0.000000 0.037305)
(0.057057 0.000000 0.037582)
(0.058058 0.000000 0.037856)
(0.059059 0.000000 0.038125)
(0.060060 0.000000 0.038392)
(0.061061 0.000000 0.038655)
(0.062062 0.000000 0.038914)
(0.063063 0.000000 0.039170)
(0.064064 0.000000 0.039424)
(0.065065 0.000000 0.039674)
(0.066066 0.000000 0.039921)
(0.067067 0.000000 0.040165)
(0.068068 0.000000 0.040406)
(0.069069 0.000000 0.040644)
(0.070070 0.000000 0.040879)
(0.071071 0.000000 0.041112)
(0.072072 0.000000 0.041342)
(0.073073 0.000000 0.041569)
(0.074074 0.000000 0.041794)
(0.075075 0.000000 0.042016)
(0.076076 0.000000 0.042235)
(0.077077 0.000000 0.042452)
(0.078078 0.000000 0.042667)
(0.079079 0.000000 0.042879)
(0.080080 0.000000 0.043089)
(0.081081 0.000000 0.043297)
(0.082082 0.000000 0.043502)
(0.083083 0.000000 0.043705)
(0.084084 0.000000 0.043906)
(0.085085 0.000000 0.044104)
(0.086086 0.000000 0.044301)
(0.087087 0.000000 0.044495)
(0.088088 0.000000 0.044688)
(0.089089 0.000000 0.044878)
(0.090090 0.000000 0.045066)
(0.091091 0.000000 0.045253)
(0.092092 0.000000 0.045437)
(0.093093 0.000000 0.045620)
(0.094094 0.000000 0.045800)
(0.095095 0.000000 0.045979)
(0.096096 0.000000 0.046155)
(0.097097 0.000000 0.046330)
(0.098098 0.000000 0.046504)
(0.099099 0.000000 0.046675)
(0.100100 0.000000 0.046845)
(0.101101 0.000000 0.047012)
(0.102102 0.000000 0.047179)
(0.103103 0.000000 0.047343)
(0.104104 0.000000 0.047506)
(0.105105 0.000000 0.047667)
(0.106106 0.000000 0.047827)
(0.107107 0.000000 0.047984)
(0.108108 0.000000 0.048141)
(0.109109 0.000000 0.048295)
(0.110110 0.000000 0.048449)
(0.111111 0.000000 0.048600)
(0.112112 0.000000 0.048750)
(0.113113 0.000000 0.048899)
(0.114114 0.000000 0.049046)
(0.115115 0.000000 0.049192)
(0.116116 0.000000 0.049336)
(0.117117 0.000000 0.049479)
(0.118118 0.000000 0.049620)
(0.119119 0.000000 0.049760)
(0.120120 0.000000 0.049898)
(0.121121 0.000000 0.050035)
(0.122122 0.000000 0.050171)
(0.123123 0.000000 0.050306)
(0.124124 0.000000 0.050439)
(0.125125 0.000000 0.050570)
(0.126126 0.000000 0.050701)
(0.127127 0.000000 0.050830)
(0.128128 0.000000 0.050958)
(0.129129 0.000000 0.051084)
(0.130130 0.000000 0.051210)
(0.131131 0.000000 0.051334)
(0.132132 0.000000 0.051456)
(0.133133 0.000000 0.051578)
(0.134134 0.000000 0.051698)
(0.135135 0.000000 0.051818)
(0.136136 0.000000 0.051935)
(0.137137 0.000000 0.052052)
(0.138138 0.000000 0.052168)
(0.139139 0.000000 0.052282)
(0.140140 0.000000 0.052396)
(0.141141 0.000000 0.052508)
(0.142142 0.000000 0.052619)
(0.143143 0.000000 0.052729)
(0.144144 0.000000 0.052837)
(0.145145 0.000000 0.052945)
(0.146146 0.000000 0.053051)
(0.147147 0.000000 0.053157)
(0.148148 0.000000 0.053261)
(0.149149 0.000000 0.053365)
...
)
    polyLine 2 9 (
(0.050050 0.100000 0.035562)
(0.051051 0.100000 0.035863)
(0.052052 0.100000 0.036159)
(0.053053 0.100000 0.036452)
(0.054054 0.100000 0.036740)
(0.055055 0.100000 0.037025)
(0.056056 0.100000 0.037305)
(0.057057 0.100000 0.037582)
(0.058058 0.100000 0.037856)
(0.059059 0.100000 0.038125)
(0.060060 0.100000 0.038392)
(0.061061 0.100000 0.038655)
(0.062062 0.100000 0.038914)
(0.063063 0.100000 0.039170)
(0.064064 0.100000 0.039424)
(0.065065 0.100000 0.039674)
(0.066066 0.100000 0.039921)
(0.067067 0.100000 0.040165)
(0.068068 0.100000 0.040406)
(0.069069 0.100000 0.040644)
(0.070070 0.100000 0.040879)
(0.071071 0.100000 0.041112)
(0.072072 0.100000 0.041342)
(0.073073 0.100000 0.041569)
(0.074074 0.100000 0.041794)
(0.075075 0.100000 0.042016)
(0.076076 0.100000 0.042235)
(0.077077 0.100000 0.042452)
(0.078078 0.100000 0.042667)
(0.079079 0.100000 0.042879)
(0.080080 0.100000 0.043089)
(0.081081 0.100000 0.043297)
(0.082082 0.100000 0.043502)
(0.083083 0.100000 0.043705)
(0.084084 0.100000 0.043906)
(0.085085 0.100000 0.044104)
(0.086086 0.100000 0.044301)
(0.087087 0.100000 0.044495)
(0.088088 0.100000 0.044688)
(0.089089 0.100000 0.044878)
(0.090090 0.100000 0.045066)
(0.091091 0.100000 0.045253)
(0.092092 0.100000 0.045437)
(0.093093 0.100000 0.045620)
(0.094094 0.100000 0.045800)
(0.095095 0.100000 0.045979)
(0.096096 0.100000 0.046155)
(0.097097 0.100000 0.046330)
(0.098098 0.100000 0.046504)
(0.099099 0.100000 0.046675)
(0.100100 0.100000 0.046845)
(0.101101 0.100000 0.047012)
(0.102102 0.100000 0.047179)
(0.103103 0.100000 0.047343)
(0.104104 0.100000 0.047506)
(0.105105 0.100000 0.047667)
(0.106106 0.100000 0.047827)
(0.107107 0.100000 0.047984)
(0.108108 0.100000 0.048141)
(0.109109 0.100000 0.048295)
(0.110110 0.100000 0.048449)
(0.111111 0.100000 0.048600)
(0.112112 0.100000 0.048750)
(0.113113 0.100000 0.048899)
(0.114114 0.100000 0.049046)
(0.115115 0.100000 0.049192)
(0.116116 0.100000 0.049336)
(0.117117 0.100000 0.049479)
(0.118118 0.100000 0.049620)
(0.119119 0.100000 0.049760)
(0.120120 0.100000 0.049898)
(0.121121 0.100000 0.050035)
(0.122122 0.100000 0.050171)
(0.123123 0.100000 0.050306)
(0.124124 0.100000 0.050439)
(0.125125 0.100000 0.050570)
(0.126126 0.100000 0.050701)
(0.127127 0.100000 0.050830)
(0.128128 0.100000 0.050958)
(0.129129 0.100000 0.051084)
(0.130130 0.100000 0.051210)
(0.131131 0.100000 0.051334)
(0.132132 0.100000 0.051456)
(0.133133 0.100000 0.051578)
(0.134134 0.100000 0.051698)
(0.135135 0.100000 0.051818)
(0.136136 0.100000 0.051935)
(0.137137 0.100000 0.052052)
(0.138138 0.100000 0.052168)
(0.139139 0.100000 0.052282)
(0.140140 0.100000 0.052396)
(0.141141 0.100000 0.052508)
(0.142142 0.100000 0.052619)
(0.143143 0.100000 0.052729)
(0.144144 0.100000 0.052837)
(0.145145 0.100000 0.052945)
(0.146146 0.100000 0.053051)
(0.147147 0.100000 0.053157)
(0.148148 0.100000 0.053261)
(0.149149 0.100000 0.053365)
...
  ); 	

