chapter4/naca/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-08;
        relTol          0.1;
    }

	k   
	{   
		solver           smoothSolver;
		smoother         GaussSeidel;
		tolerance        1e-8;
		relTol           0.1;
		nSweeps          1;  
	};  

	omega
	{   
		solver           smoothSolver;
		smoother         GaussSeidel;
		tolerance        1e-8;
		relTol           0.1;
		nSweeps          1;  
	};
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    default         0;
    p               0.3;
    U               0.7;
	k				0.7;
	omega			0.7;
}


// ************************************************************************* //
